//スタート地点の座標
#define SX 1
#define SY 1
//ゴール地点の座標
#define GX 8
#define GY 1
//迷路データ
int map[7][10] = {{1,1,1,1,1,1,1,1,1,1}.
                  {1,0,0,0,0,0,1,0,0,1},
                  {1,0,1,0,1,0,0,0,1,1},
                  {1,0,0,1,0,0,0,1,0,1},
                  {1,1,0,1,0,1,0,1,0,1},
                  {1,0,0,0,0,1,0,0,0,1},
                  {1,1,1,1,1,1,1,1,1,1}};
#define STACKSIZE 46
int stack[STACKSIZE];
int sp = 0;

//迷路描画関数
void DrawMaze(void)
{
int i, j;

for (i = 0; i < 7; i++) {//行列分の繰り返し
    for (j = 0; j < 10; j++) {//列数分の繰り返し
        //迷路描画関数
    }
}
return;
}
//スタックにデータを積む